/*2. У вас есть массив с ценами товаров в чеке. В консоль нужно вывести сумму всех цен и среднюю цену товара.
  Итого: 8495 $, средняя цена товара 700 $ - пример сообщения в консоле.  
  const prices = [64, 7556, 345, 7556, 345, 7556, 345, 7556, 433, 345, 756, 123, 942, 3112, 421, 9341, 1212, 8, 43, 41, 345, 341, 21, 321, 123];



const prices = [
  64, 7556, 345, 7556, 345, 7556, 345, 7556, 433, 345, 756, 123, 942, 3112, 421,
  9341, 1212, 8, 43, 41, 345, 341, 21, 321, 123,
];
let sum_1 = 0;
for (let index = 0; index < prices.length; index++) {
  const element = prices[index];
  sum_1 += element;
}
console.log(
  "Итого: " +
    sum_1 +
    " $, средняя цена товара " +
    sum_1 / (prices.length + 1) +
    " $"
);
*/

const prices = [
  64, 7556, 345, 7556, 345, 7556, 345, 7556, 433, 345, 756, 123, 942, 3112, 421,
  9341, 1212, 8, 43, 41, 345, 341, 21, 321, 123,
];

const sum_1 = prices.reduce((sum, price) => sum + price, 0);
const averagePrice = sum_1 / prices.length;

console.log(
  "Итого: ",
  sum_1,
  "$, средняя цена товара",
  Math.round(averagePrice),
  "$"
);
